In [14]:
import pandas as pd
import numpy as np
a=[1,2,3,4]

k=pd.Series(a)
k

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
b={"name":["Resmi","ann","leena"],
  "age":[18,24,45]}

df = pd.DataFrame(b)[['age']]
print(df)

   age   name
0   18  Resmi
1   24    ann
2   45  leena

In [30]:
df=pd.read_csv("emp.csv",usecols=['ename','salary'])
type(df)

pandas.core.frame.DataFrame

In [31]:
a=({
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'salary':[50000, 60000, 55000, 70000, 65000],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR']
})
df=pd.DataFrame(a)
df

      Name  salary Department
0    Alice   50000         HR
1      Bob   60000         IT
2  Charlie   55000         IT
3    David   70000    Finance
4      Eva   65000         HR

In [33]:
df=df.head(3)
df

      Name  salary Department
0    Alice   50000         HR
1      Bob   60000         IT
2  Charlie   55000         IT

In [34]:
df=df.tail(2)
df

      Name  salary Department
1      Bob   60000         IT
2  Charlie   55000         IT

In [35]:
a=({
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'salary':[50000, 60000, 55000, 70000, 65000],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR']
})
df=pd.DataFrame(a)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   salary      5 non-null      int64
 2   Department  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [37]:
df=df.describe()
df

            salary
count      5.00000
mean   60000.00000
std     7905.69415
min    50000.00000
25%    55000.00000
50%    60000.00000
75%    65000.00000
max    70000.00000

In [41]:
a=({
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'salary':[50000, 60000, 55000, 70000, 65000],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR']
})
df=pd.DataFrame(a)
df=df['salary']
df

0    50000
1    60000
2    55000
3    70000
4    65000
Name: salary, dtype: int64

In [42]:
df=df[]
df

np.int64(70000)

In [48]:
a=({
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'salary':[50000, 60000, 55000, 70000, 65000],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR']
})
df=pd.DataFrame(a)
df=df.loc[[3]]
df

    Name  salary Department
3  David   70000    Finance

In [65]:
a=({
    'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'salary':[50000, 60000, 55000, 70000, 65000],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR']
})
df=pd.DataFrame(a)

df['Bonus'] = df['salary'] * 0.1
df

      Name  salary Department   Bonus
0    Alice   50000         HR  5000.0
1      Bob   60000         IT  6000.0
2  Charlie   55000         IT  5500.0
3    David   70000    Finance  7000.0
4      Eva   65000         HR  6500.0

In [82]:
k=df[(df['Department']=='IT') & (df['salary']>5000)]
g=k[['Name','Bonus']]
g

      Name   Bonus
1      Bob  6000.0
2  Charlie  5500.0

In [84]:
import pandas as pd
df=pd.read_csv("employees.csv")
df['Bonus']=df['Salary']*0.1
df

   ID     Name  Salary Department   Bonus
0   1    Alice   50000         HR  5000.0
1   2      Bob   60000         IT  6000.0
2   3  Charlie   55000         IT  5500.0
3   4    David   70000    Finance  7000.0
4   5      Eva   65000         HR  6500.0

In [87]:
#Bonus > 6000
df=pd.read_csv("employees.csv")
df['Bonus']=df['Salary']*0.1
df=df[df['Bonus']>6000]
df

   ID   Name  Salary Department   Bonus
3   4  David   70000    Finance  7000.0
4   5    Eva   65000         HR  6500.0

In [89]:
df=pd.read_csv("employees.csv")
df= df[(df['Department']=='IT') |(df['Department']=='HR')]
df

   ID     Name  Salary Department
0   1    Alice   50000         HR
1   2      Bob   60000         IT
2   3  Charlie   55000         IT
4   5      Eva   65000         HR

In [90]:
#55000 and 70000
df=pd.read_csv("employees.csv")
df= df[(df['Salary']>55000) & (df['Salary']<70000)]
df

   ID Name  Salary Department
1   2  Bob   60000         IT
4   5  Eva   65000         HR

In [94]:
df=pd.read_csv("employees.csv")
df= df.sort_values('Salary',ascending=False)
df=df.head(3)
df

   ID   Name  Salary Department
3   4  David   70000    Finance
4   5    Eva   65000         HR
1   2    Bob   60000         IT

In [95]:
#Bonus < 6000
df=pd.read_csv("employees.csv")
df['Bonus']=df['Salary']*0.1
df=df[df['Bonus']<6000]
df

   ID     Name  Salary Department   Bonus
0   1    Alice   50000         HR  5000.0
2   3  Charlie   55000         IT  5500.0

In [109]:
df=pd.read_csv("employees.csv")
x=df.groupby('Department')
x.count()

            ID  Name  Salary
Department
Finance      1     1       1
HR           2     2       2
IT           2     2       2

In [100]:
df=pd.read_csv("employees.csv")
df['Newsalary']=df['Salary']*1.05
df

   ID     Name  Salary Department  Newsalary
0   1    Alice   50000         HR    52500.0
1   2      Bob   60000         IT    63000.0
2   3  Charlie   55000         IT    57750.0
3   4    David   70000    Finance    73500.0
4   5      Eva   65000         HR    68250.0

In [107]:
#Filter employees who are in IT or HR AND have Bonus > 6000.

#Print Name, Department, Bonus.
df=pd.read_csv("employees.csv")
df['Bonus']=df['Salary']*0.1

k=df[((df['Department']=='IT') |(df['Department']=='HR')) & (df['Bonus']>6000)]
k

   ID Name  Salary Department   Bonus
4   5  Eva   65000         HR  6500.0